<template>
    
    <div id="section-rules" class="section">
        <div class="container">
            <div class="md-layout">
                <div class="md-layout-item md-size-80 md-xsmall-size-100 mx-auto">
                    <!-- <h2 class="text-center title">競賽規則</h2>
                    <p class="description">
                        所有對於農業合作有興趣的朋友、專業團隊以及各大專院校學生皆可組隊報名，報名以團隊方式受理，每隊人數 1 - 6 人，團隊中至少需有 1 人具備資料分析與應用或前端視覺化開發之技術或經驗。
                    </p>
                    <p class="description">
                        本次競賽分兩階段進行：初審及決賽。團隊報名時須提供<a class="emphasis" :href="url_proposal" target="_blank">「提案說明」</a>作為初審之評選依據。入選之團隊將於 16 - 17 日的決賽進行 24 小時的黑客松競賽，須依照提案針對特定食農議題，利用程式設計發展解決方案。
                    </p>
                    <p class="description">
                        參賽提案需鎖定至少一個食農相關問題，具備「合作」之精神，結合軟體與資料分析技術發展解決方案。活動過程不限開發語言，但資料成果須公開發表，並將競賽提案相關原始碼上傳至 GitHub。本活動歡迎偷跑，可先行構思，但禁止使用已完成並公開發表之作品參加比賽。
                    </p>
                    <p class="description">
                        我們對「合作精神」的想像，至少包括了「共享」、「共學」與「共造」等精神，也就是透過共同分享資源、結合各領域專業共同學習成長，進而打造創新的概念與社會性的產品，用集體的力量解決問題。我們也歡迎各位提出您對「合作精神」的想像，用合作創造更完整的合作。
                    </p>

                    <br> -->

                    <h2 class="text-center title">參賽辦法</h2>
                    <!-- <h3>參賽辦法</h3> -->
                    <p>
                        <ol>
                            <li>
                                凡是對食農有興趣，不限性別、年齡，各領域的好手，皆可組隊報名。報名以團隊方式受理，每隊人數 1 - 6 人。由於本活動強調數位技術、程式設計與議題社群等跨界工作者合作共創，解決問題，且決賽時需提供活動過程產出之程式碼作為評選，建議團隊中至少有 1 人具備資料分析與應用或前端視覺化開發之技術或經驗。
                            </li>
                            <li>
                                本活動全程免費，但需繳交保證金 1000 元／隊。初選未入圍之團隊，將於 2019 年 11 月 15 日前，退還至團隊代表人指定帳戶。決賽團隊之保證金將於 11 月 17 日決賽活動現場全額退回，未全程完成活動之團隊恕不退還。11 月 16 日 (六) 上午 9:00 舉辦之論壇為本次活動之一部分，入圍團隊須至少派 1 名成員參與論壇，方算全程完成活動。
                            </li>
                            <li>
                                報名時間自 2019 年 10 月 1 日 (二) 上午 10:00 至 10 月 27 日 (日) 23:59 止。報名參賽隊伍需自行至 KKTIX 完成報名、繳交保證金，並需完成填寫<a class="emphasis" :href="url_proposal" target="_blank">「提案說明」、「活動同意書」與「著作權授權書」( 請按我下載 ) </a>填寫掃描後存成 pdf 檔，寄件至 coopathon2019@gmail.com，標題請填寫「2019食農合作松（團隊名稱 – 團隊代表人姓名）」。寄件後，大會將於兩個工作天內回覆，若無收到回信，請撥打電話確認。
                            </li>
                            <li>
                                禁止使用已完成並公開發表之作品參加比賽，若題目曾公開發表，則須於提案時清楚說明本次提案內容與先前公開版本之差異。若經大會發現或經檢舉並查證屬實，大會將取消參與資格或獲獎名次，團隊並須返還全額獎金。
                            </li>
                            <li>
                                參賽作品必須遵守所有法規，並以開放源始碼發佈，採用 Creative Commons 授權規則中的「署名-非商業性使用-相同方式共享」的授權許可，參與團隊其延續作品或衍生作品則不在此限。
                            </li>
                        </ol>
                    </p>

                    <br>

                    <h3>本次活動分兩階段進行：初選及決賽。</h3>
                    <p>
                        <ol>
                            <li>
                                初選：<br>
                                <ul>
                                    <li>
                                        11 月 4 日 (一) 中午 12:00 於活動網站公告初選入圍名單。初選入圍依據團隊報名時所提供「提案說明」作為初選之評選依據。
                                    </li>
                                </ul>
                            </li>
                            <li>
                                決賽：<br>
                                <ul>
                                    <li>
                                        初選入圍團隊可於決賽日前事先將提案構思實作，並於 2019 年 11 月 16 至 17 日的決賽現場進行 24 小時的創作，須依照提案針對之特定食農議題，發揮合作共創的精神，利用程式設計發展解決方案。
                                    </li>
                                    <li>
                                        活動過程不限開發語言，但資料成果需公開發表。參與團隊須於決賽日第二天（ 2019 年 11 月 17 日）中午 12:00，將活動期間開發之原始碼上傳至指定的 Github，並需派人上台以中文發表簡報及開發成果，每隊報告 6 分鐘、評委問答 6 分鐘，共計 12 分鐘。
                                    </li>
                                </ul>
                            </li>
                        </ol>
                    </p>

                    <br>

                    <h3>注意事項</h3>
                    <p>
                        <ol>
                            <li>
                                報名時間自 10 月 1 日 (二) 上午 10:00 至 10 月 27 日（日）23:59 止，一律採網路報名。馬上報名！
                            </li>
                            <li>
                                現場提供餐飲茶水、網路、電力設備，但無衛浴設備，參與者可依個人需求攜帶所需設備，如筆電、平板、睡袋等。
                            </li>
                        </ol>
                    </p>

                </div>
            </div>
        </div>
    </div>

</template>

<script>
export default {
    data () {
        return {
            url_kktix: '#',
            url_proposal: './files/2019食農合作松報名文件.zip',
            url_agreement: '#',
            url_copyright: '#',
        }
    },
}
</script>

<style lang="scss" scoped>

h3 {
    margin-bottom: 20px;
}
li {
    margin-bottom: 15px;
}

</style>